In [35]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [7]:
!cat example1.csv
#!type example1.csv

a1,a2,b1,b2,greeting
1,2,3,4,hello world
5, 6, 7, 8, bob
9,10,11,12,dave

In [5]:
pd.read_csv("example1.csv")

   a1  a2  b1  b2     greeting
0   1   2   3   4  hello world
1   5   6   7   8          bob
2   9  10  11  12         dave

In [8]:
!cat example2.csv

1,2,3,4,hello world
5, 6, 7, 8, bob
9,10,11,12,dave

In [9]:
pd.read_csv("example2.csv", header=None)

   0   1   2   3            4
0  1   2   3   4  hello world
1  5   6   7   8          bob
2  9  10  11  12         dave

In [11]:
pd.read_csv("example2.csv", names=["one","two","three","four","message"])

   one  two  three  four      message
0    1    2      3     4  hello world
1    5    6      7     8          bob
2    9   10     11    12         dave

In [12]:
pd.read_csv("example2.csv", names=["one","two","three","four","message"], index_col="message")

             one  two  three  four
message
hello world    1    2      3     4
 bob           5    6      7     8
dave           9   10     11    12

In [13]:
list(open("example3.txt"))

['         A       B       C\n',
 'bob      1       23      45\n',
 'james    21      43      58\n',
 'anne     32      213     12']

In [15]:
# Use regex for separation
pd.read_csv("example3.txt", sep="\s+")

        A    B   C
bob     1   23  45
james  21   43  58
anne   32  213  12

In [17]:
pd.read_csv("example4.csv")

    name    id   test1   test2
0  helen   132  missed     5.4
1   dave  4267     5.2     7.6
2   jane    12     6.3  missed

In [18]:
pd.read_csv("example4.csv", na_values=["missed"])

    name    id  test1  test2
0  helen   132    NaN    5.4
1   dave  4267    5.2    7.6
2   jane    12    6.3    NaN

## Exploring data ##

In [28]:
# Let's make a very large file and save it
with open("large.csv", mode="w") as f:
    print("one,two,three,four,key", file=f)
    keys=list("ABCDEFGHIJKLMNOPQRSTUVWXYZ")
    for _ in range(1000):
        s = ",".join(str(x) for x in np.random.randn(4))
        print("{},{}".format(s,keys[np.random.randint(0,26)]), file=f)

In [30]:
pd.read_csv("large.csv", nrows=5)

        one       two     three      four key
0  0.977986  0.038640  0.959817 -0.656895   C
1 -0.893307 -0.033133  0.243660 -0.755031   Q
2 -0.004061  0.835206 -0.462747 -0.843840   I
3  2.552005  1.968677 -0.835453 -0.863846   R
4  0.227782 -0.274165 -0.216100 -0.295930   V

In [33]:
chunker = pd.read_csv("large.csv", chunksize=10)
next(chunker)

        one       two     three      four key
0  0.977986  0.038640  0.959817 -0.656895   C
1 -0.893307 -0.033133  0.243660 -0.755031   Q
2 -0.004061  0.835206 -0.462747 -0.843840   I
3  2.552005  1.968677 -0.835453 -0.863846   R
4  0.227782 -0.274165 -0.216100 -0.295930   V
5 -0.996287  0.633826 -0.401498 -1.578443   X
6  0.853284 -1.177185  0.340375  0.269678   M
7 -1.113775 -0.266492 -1.125548 -0.342883   Y
8 -0.437794  1.167021  0.123374  0.395315   M
9 -1.628036  0.151884  0.891531  0.235666   Y

In [38]:
chunker = pd.read_csv("large.csv", chunksize=10)
totals = Series([])
for part in chunker:
    totals = totals.add(part["key"].value_counts(), fill_value=0)
totals["A":"E"]

A    33.0
B    43.0
C    44.0
D    34.0
E    38.0
dtype: float64